# 定义函数
def chain(list):
    after_list = []
    for l in list:
        # 占比，集合后的不重复的字占集合前的0.7
        if len(set(l)) / len(l) > 0.7:
            # 将其添加到第二个列表中
            after_list.append(l)
    print("前：", list)
    print("后", after_list)
    return list, after_list


comments = ['这是一本非常好的书，作者用心了',
            '作者大大辛苦了',
            '好书，感谢作者提供了这么多的好案例',
            '啊啊啊啊啊啊，我怎么才发现这么好的书啊，相见恨晚',
            '好好好好好好好好好好好',
            '好难啊看不懂好难啊看不懂好难啊看不懂',
            '书的内容很充实',
            '物超所值，好书，赞一个',
            '32个赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞赞',
            '你的书上好多代码啊，不过想想也是，编程的书嘛，肯定代码多一些',
            '书很不错!!一级棒!!买书就上当当，正版，价格又实惠，让人放心!!! ',
            '无意中来到你小铺就淘到心意的宝贝，心情不错! ',
            '送给朋友的、很不错',
            '老师让买的，果然不错，没有让我失望']

chain(comments)
